MaterialFoundry/MaterialFoundry_Arduino/boards.txt
#materialPlane_Sensor.menu.DFUOnBoot.default=Disabled
#materialPlane_Sensor.menu.DFUOnBoot.default.build.dfu_on_boot=0
#materialPlane_Sensor.menu.DFUOnBoot.dfu=Enabled (Requires USB-OTG Mode)
#materialPlane_Sensor.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

#materialPlane_Sensor.menu.UploadMode.default=UART0 / Hardware CDC
#materialPlane_Sensor.menu.UploadMode.default.upload.use_1200bps_touch=false
#materialPlane_Sensor.menu.UploadMode.default.upload.wait_for_upload_port=false
#materialPlane_Sensor.menu.UploadMode.cdc=USB-OTG CDC (TinyUSB)
#materialPlane_Sensor.menu.UploadMode.cdc.upload.use_1200bps_touch=true
#materialPlane_Sensor.menu.UploadMode.cdc.upload.wait_for_upload_port=true

#materialPlane_Sensor.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
#materialPlane_Sensor.menu.PartitionScheme.default.build.partitions=default
#materialPlane_Sensor.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
#materialPlane_Sensor.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
#materialPlane_Sensor.menu.PartitionScheme.default_8MB=8M with spiffs (3MB APP/1.5MB SPIFFS)
#materialPlane_Sensor.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
#materialPlane_Sensor.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
#materialPlane_Sensor.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
#materialPlane_Sensor.menu.PartitionScheme.minimal.build.partitions=minimal
#materialPlane_Sensor.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
#materialPlane_Sensor.menu.PartitionScheme.no_ota.build.partitions=no_ota
#materialPlane_Sensor.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
#materialPlane_Sensor.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
#materialPlane_Sensor.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
#materialPlane_Sensor.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
#materialPlane_Sensor.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
#materialPlane_Sensor.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
#materialPlane_Sensor.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
#materialPlane_Sensor.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
#materialPlane_Sensor.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
#materialPlane_Sensor.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
#materialPlane_Sensor.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
#materialPlane_Sensor.menu.PartitionScheme.huge_app.build.partitions=huge_app
#materialPlane_Sensor.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
#materialPlane_Sensor.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
#materialPlane_Sensor.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
#materialPlane_Sensor.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
#materialPlane_Sensor.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FATFS)
#materialPlane_Sensor.menu.PartitionScheme.fatflash.build.partitions=ffat
#materialPlane_Sensor.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
#materialPlane_Sensor.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9.9MB FATFS)
#materialPlane_Sensor.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
#materialPlane_Sensor.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
#materialPlane_Sensor.menu.PartitionScheme.rainmaker=RainMaker
#materialPlane_Sensor.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
#materialPlane_Sensor.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

#materialPlane_Sensor.menu.CPUFreq.240=240MHz (WiFi)
#materialPlane_Sensor.menu.CPUFreq.240.build.f_cpu=240000000L
#materialPlane_Sensor.menu.CPUFreq.160=160MHz (WiFi)
#materialPlane_Sensor.menu.CPUFreq.160.build.f_cpu=160000000L
#materialPlane_Sensor.menu.CPUFreq.80=80MHz (WiFi)
#materialPlane_Sensor.menu.CPUFreq.80.build.f_cpu=80000000L
#materialPlane_Sensor.menu.CPUFreq.40=40MHz
#materialPlane_Sensor.menu.CPUFreq.40.build.f_cpu=40000000L
#materialPlane_Sensor.menu.CPUFreq.20=20MHz
#materialPlane_Sensor.menu.CPUFreq.20.build.f_cpu=20000000L
#materialPlane_Sensor.menu.CPUFreq.10=10MHz
#materialPlane_Sensor.menu.CPUFreq.10.build.f_cpu=10000000L

materialPlane_Sensor.menu.UploadSpeed.921600=921600
materialPlane_Sensor.menu.UploadSpeed.921600.upload.speed=921600
materialPlane_Sensor.menu.UploadSpeed.115200=115200
materialPlane_Sensor.menu.UploadSpeed.115200.upload.speed=115200
materialPlane_Sensor.menu.UploadSpeed.256000.windows=256000
materialPlane_Sensor.menu.UploadSpeed.256000.upload.speed=256000
materialPlane_Sensor.menu.UploadSpeed.230400.windows.upload.speed=256000
materialPlane_Sensor.menu.UploadSpeed.230400=230400
materialPlane_Sensor.menu.UploadSpeed.230400.upload.speed=230400
materialPlane_Sensor.menu.UploadSpeed.460800.linux=460800
materialPlane_Sensor.menu.UploadSpeed.460800.macosx=460800
materialPlane_Sensor.menu.UploadSpeed.460800.upload.speed=460800
materialPlane_Sensor.menu.UploadSpeed.512000.windows=512000
materialPlane_Sensor.menu.UploadSpeed.512000.upload.speed=512000

materialPlane_Sensor.menu.DebugLevel.none=None
materialPlane_Sensor.menu.DebugLevel.none.build.code_debug=0
materialPlane_Sensor.menu.DebugLevel.error=Error
materialPlane_Sensor.menu.DebugLevel.error.build.code_debug=1
materialPlane_Sensor.menu.DebugLevel.warn=Warn
materialPlane_Sensor.menu.DebugLevel.warn.build.code_debug=2
materialPlane_Sensor.menu.DebugLevel.info=Info
materialPlane_Sensor.menu.DebugLevel.info.build.code_debug=3
materialPlane_Sensor.menu.DebugLevel.debug=Debug
materialPlane_Sensor.menu.DebugLevel.debug.build.code_debug=4
materialPlane_Sensor.menu.DebugLevel.verbose=Verbose
materialPlane_Sensor.menu.DebugLevel.verbose.build.code_debug=5

materialPlane_Sensor.menu.EraseFlash.none=Disabled
materialPlane_Sensor.menu.EraseFlash.none.upload.erase_cmd=
materialPlane_Sensor.menu.EraseFlash.all=Enabled
materialPlane_Sensor.menu.EraseFlash.all.upload.erase_cmd=-e

