MaterialFoundry/MaterialFoundry_Arduino/boards.txt
#materialPlane_sensor_diy_full.menu.CPUFreq.240=240MHz (WiFi/BT)
#materialPlane_sensor_diy_full.menu.CPUFreq.240.build.f_cpu=240000000L
#materialPlane_sensor_diy_full.menu.CPUFreq.160=160MHz (WiFi/BT)
#materialPlane_sensor_diy_full.menu.CPUFreq.160.build.f_cpu=160000000L
#materialPlane_sensor_diy_full.menu.CPUFreq.80=80MHz (WiFi/BT)
#materialPlane_sensor_diy_full.menu.CPUFreq.80.build.f_cpu=80000000L
#materialPlane_sensor_diy_full.menu.CPUFreq.40=40MHz (40MHz XTAL)
#materialPlane_sensor_diy_full.menu.CPUFreq.40.build.f_cpu=40000000L
#materialPlane_sensor_diy_full.menu.CPUFreq.26=26MHz (26MHz XTAL)
#materialPlane_sensor_diy_full.menu.CPUFreq.26.build.f_cpu=26000000L
#materialPlane_sensor_diy_full.menu.CPUFreq.20=20MHz (40MHz XTAL)
#materialPlane_sensor_diy_full.menu.CPUFreq.20.build.f_cpu=20000000L
#materialPlane_sensor_diy_full.menu.CPUFreq.13=13MHz (26MHz XTAL)
#materialPlane_sensor_diy_full.menu.CPUFreq.13.build.f_cpu=13000000L
#materialPlane_sensor_diy_full.menu.CPUFreq.10=10MHz (40MHz XTAL)
#materialPlane_sensor_diy_full.menu.CPUFreq.10.build.f_cpu=10000000L

#materialPlane_sensor_diy_full.menu.FlashMode.qio=QIO
#materialPlane_sensor_diy_full.menu.FlashMode.qio.build.flash_mode=dio
#materialPlane_sensor_diy_full.menu.FlashMode.qio.build.boot=qio
#materialPlane_sensor_diy_full.menu.FlashMode.dio=DIO
#materialPlane_sensor_diy_full.menu.FlashMode.dio.build.flash_mode=dio
#materialPlane_sensor_diy_full.menu.FlashMode.dio.build.boot=dio
#materialPlane_sensor_diy_full.menu.FlashMode.qout=QOUT
#materialPlane_sensor_diy_full.menu.FlashMode.qout.build.flash_mode=dout
#materialPlane_sensor_diy_full.menu.FlashMode.qout.build.boot=qout
#materialPlane_sensor_diy_full.menu.FlashMode.dout=DOUT
#materialPlane_sensor_diy_full.menu.FlashMode.dout.build.flash_mode=dout
#materialPlane_sensor_diy_full.menu.FlashMode.dout.build.boot=dout

#materialPlane_sensor_diy_full.menu.FlashFreq.80=80MHz
#materialPlane_sensor_diy_full.menu.FlashFreq.80.build.flash_freq=80m
#materialPlane_sensor_diy_full.menu.FlashFreq.40=40MHz
#materialPlane_sensor_diy_full.menu.FlashFreq.40.build.flash_freq=40m

#materialPlane_sensor_diy_full.menu.FlashSize.4M=4MB (32Mb)
#materialPlane_sensor_diy_full.menu.FlashSize.4M.build.flash_size=4MB
#materialPlane_sensor_diy_full.menu.FlashSize.8M=8MB (64Mb)
#materialPlane_sensor_diy_full.menu.FlashSize.8M.build.flash_size=8MB
#materialPlane_sensor_diy_full.menu.FlashSize.8M.build.partitions=default_8MB
#materialPlane_sensor_diy_full.menu.FlashSize.2M=2MB (16Mb)
#materialPlane_sensor_diy_full.menu.FlashSize.2M.build.flash_size=2MB
#materialPlane_sensor_diy_full.menu.FlashSize.2M.build.partitions=minimal
#materialPlane_sensor_diy_full.menu.FlashSize.16M=16MB (128Mb)
#materialPlane_sensor_diy_full.menu.FlashSize.16M.build.flash_size=16MB

materialPlane_sensor_diy_full.menu.UploadSpeed.921600=921600
materialPlane_sensor_diy_full.menu.UploadSpeed.921600.upload.speed=921600
materialPlane_sensor_diy_full.menu.UploadSpeed.115200=115200
materialPlane_sensor_diy_full.menu.UploadSpeed.115200.upload.speed=115200
materialPlane_sensor_diy_full.menu.UploadSpeed.256000.windows=256000
materialPlane_sensor_diy_full.menu.UploadSpeed.256000.upload.speed=256000
materialPlane_sensor_diy_full.menu.UploadSpeed.230400.windows.upload.speed=256000
materialPlane_sensor_diy_full.menu.UploadSpeed.230400=230400
materialPlane_sensor_diy_full.menu.UploadSpeed.230400.upload.speed=230400
materialPlane_sensor_diy_full.menu.UploadSpeed.460800.linux=460800
materialPlane_sensor_diy_full.menu.UploadSpeed.460800.macosx=460800
materialPlane_sensor_diy_full.menu.UploadSpeed.460800.upload.speed=460800
materialPlane_sensor_diy_full.menu.UploadSpeed.512000.windows=512000
materialPlane_sensor_diy_full.menu.UploadSpeed.512000.upload.speed=512000

#materialPlane_sensor_diy_full.menu.LoopCore.1=Core 1
#materialPlane_sensor_diy_full.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
#materialPlane_sensor_diy_full.menu.LoopCore.0=Core 0
#materialPlane_sensor_diy_full.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

#materialPlane_sensor_diy_full.menu.EventsCore.1=Core 1
#materialPlane_sensor_diy_full.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
#materialPlane_sensor_diy_full.menu.EventsCore.0=Core 0
#materialPlane_sensor_diy_full.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

materialPlane_sensor_diy_full.menu.DebugLevel.none=None
materialPlane_sensor_diy_full.menu.DebugLevel.none.build.code_debug=0
materialPlane_sensor_diy_full.menu.DebugLevel.error=Error
materialPlane_sensor_diy_full.menu.DebugLevel.error.build.code_debug=1
materialPlane_sensor_diy_full.menu.DebugLevel.warn=Warn
materialPlane_sensor_diy_full.menu.DebugLevel.warn.build.code_debug=2
materialPlane_sensor_diy_full.menu.DebugLevel.info=Info
materialPlane_sensor_diy_full.menu.DebugLevel.info.build.code_debug=3
materialPlane_sensor_diy_full.menu.DebugLevel.debug=Debug
materialPlane_sensor_diy_full.menu.DebugLevel.debug.build.code_debug=4
materialPlane_sensor_diy_full.menu.DebugLevel.verbose=Verbose
materialPlane_sensor_diy_full.menu.DebugLevel.verbose.build.code_debug=5

materialPlane_sensor_diy_full.menu.EraseFlash.none=Disabled
materialPlane_sensor_diy_full.menu.EraseFlash.none.upload.erase_cmd=
materialPlane_sensor_diy_full.menu.EraseFlash.all=Enabled
materialPlane_sensor_diy_full.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

materialPlane_sensor_diy_full_s3.name=Material Plane Sensor (DIY Full S3)
materialPlane_sensor_diy_full_s3.vid.0=0x303a
materialPlane_sensor_diy_full_s3.pid.0=0x80D0

materialPlane_sensor_diy_full_s3.bootloader.tool=esptool_py
materialPlane_sensor_diy_full_s3.bootloader.tool.default=esptool_py

materialPlane_sensor_diy_full_s3.upload.tool=esptool_py
materialPlane_sensor_diy_full_s3.upload.tool.default=esptool_py
materialPlane_sensor_diy_full_s3.upload.tool.network=esp_ota

materialPlane_sensor_diy_full_s3.upload.maximum_size=1310720
materialPlane_sensor_diy_full_s3.upload.maximum_data_size=327680
materialPlane_sensor_diy_full_s3.upload.flags=
materialPlane_sensor_diy_full_s3.upload.extra_flags=
materialPlane_sensor_diy_full_s3.upload.use_1200bps_touch=true
materialPlane_sensor_diy_full_s3.upload.wait_for_upload_port=true

