MaterialFoundry/MaterialFoundry_Arduino/boards.txt
materialPlane_sensor_diy_basic.menu.EraseFlash.none=Disabled
materialPlane_sensor_diy_basic.menu.EraseFlash.none.upload.erase_cmd=
materialPlane_sensor_diy_basic.menu.EraseFlash.all=Enabled
materialPlane_sensor_diy_basic.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################

materialPlane_sensor_diy_basic_s3.name=Material Plane Sensor (DIY Basic S3)
materialPlane_sensor_diy_basic_s3.vid.0=0x303a
materialPlane_sensor_diy_basic_s3.pid.0=0x80D0

materialPlane_sensor_diy_basic_s3.bootloader.tool=esptool_py
materialPlane_sensor_diy_basic_s3.bootloader.tool.default=esptool_py

materialPlane_sensor_diy_basic_s3.upload.tool=esptool_py
materialPlane_sensor_diy_basic_s3.upload.tool.default=esptool_py
materialPlane_sensor_diy_basic_s3.upload.tool.network=esp_ota

materialPlane_sensor_diy_basic_s3.upload.maximum_size=1310720
materialPlane_sensor_diy_basic_s3.upload.maximum_data_size=327680
materialPlane_sensor_diy_basic_s3.upload.flags=
materialPlane_sensor_diy_basic_s3.upload.extra_flags=
materialPlane_sensor_diy_basic_s3.upload.use_1200bps_touch=true
materialPlane_sensor_diy_basic_s3.upload.wait_for_upload_port=true

materialPlane_sensor_diy_basic_s3.serial.disableDTR=false
materialPlane_sensor_diy_basic_s3.serial.disableRTS=false

materialPlane_sensor_diy_basic_s3.build.tarch=xtensa
materialPlane_sensor_diy_basic_s3.build.bootloader_addr=0x0
materialPlane_sensor_diy_basic_s3.build.target=esp32s3
materialPlane_sensor_diy_basic_s3.build.mcu=esp32s3
materialPlane_sensor_diy_basic_s3.build.core=esp32
materialPlane_sensor_diy_basic_s3.build.variant=materialPlane_sensor_diy_basic_s3
materialPlane_sensor_diy_basic_s3.build.board=ESP32S3_DEV

materialPlane_sensor_diy_basic_s3.build.usb_mode=1
materialPlane_sensor_diy_basic_s3.build.cdc_on_boot=1
materialPlane_sensor_diy_basic_s3.build.msc_on_boot=0
materialPlane_sensor_diy_basic_s3.build.dfu_on_boot=0
materialPlane_sensor_diy_basic_s3.build.f_cpu=240000000L
materialPlane_sensor_diy_basic_s3.build.flash_size=4MB
materialPlane_sensor_diy_basic_s3.build.flash_freq=80m
materialPlane_sensor_diy_basic_s3.build.flash_mode=dio
materialPlane_sensor_diy_basic_s3.build.boot=qio
materialPlane_sensor_diy_basic_s3.build.boot_freq=80m
materialPlane_sensor_diy_basic_s3.build.partitions=default
materialPlane_sensor_diy_basic_s3.build.defines=
materialPlane_sensor_diy_basic_s3.build.loop_core=
materialPlane_sensor_diy_basic_s3.build.event_core=
materialPlane_sensor_diy_basic_s3.build.psram_type=qspi
materialPlane_sensor_diy_basic_s3.build.memory_type={build.boot}_{build.psram_type}

## IDE 2.0 Seems to not update the value
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.default=Disabled
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.default.build.copy_jtag_files=0
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.builtin=Integrated USB JTAG
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.builtin.build.openocdscript=esp32s3-builtin.cfg
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.builtin.build.copy_jtag_files=1
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.external=FTDI Adapter
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.external.build.openocdscript=esp32s3-ftdi.cfg
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.external.build.copy_jtag_files=1
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.bridge=ESP USB Bridge
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.bridge.build.openocdscript=esp32s3-bridge.cfg
#materialPlane_sensor_diy_basic_s3.menu.JTAGAdapter.bridge.build.copy_jtag_files=1

#materialPlane_sensor_diy_basic_s3.menu.PSRAM.disabled=Disabled
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.disabled.build.defines=
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.disabled.build.psram_type=qspi
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.enabled=QSPI PSRAM
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.enabled.build.psram_type=qspi
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.opi=OPI PSRAM
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.opi.build.defines=-DBOARD_HAS_PSRAM
#materialPlane_sensor_diy_basic_s3.menu.PSRAM.opi.build.psram_type=opi

#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio=QIO 80MHz
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio.build.flash_mode=dio
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio.build.boot=qio
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio.build.boot_freq=80m
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio.build.flash_freq=80m
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio120=QIO 120MHz
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio120.build.flash_mode=dio
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio120.build.boot=qio
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio120.build.boot_freq=120m
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.qio120.build.flash_freq=80m
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.dio=DIO 80MHz
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.dio.build.flash_mode=dio
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.dio.build.boot=dio
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.dio.build.boot_freq=80m
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.dio.build.flash_freq=80m
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.opi=OPI 80MHz
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.opi.build.flash_mode=dout
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.opi.build.boot=opi
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.opi.build.boot_freq=80m
#materialPlane_sensor_diy_basic_s3.menu.FlashMode.opi.build.flash_freq=80m

#materialPlane_sensor_diy_basic_s3.menu.FlashSize.4M=4MB (32Mb)
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.4M.build.flash_size=4MB
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.8M=8MB (64Mb)
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.8M.build.flash_size=8MB
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.8M.build.partitions=default_8MB
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.16M=16MB (128Mb)
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.16M.build.flash_size=16MB
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.32M=32MB (256Mb)
#materialPlane_sensor_diy_basic_s3.menu.FlashSize.32M.build.flash_size=32MB

#materialPlane_sensor_diy_basic_s3.menu.LoopCore.1=Core 1
#materialPlane_sensor_diy_basic_s3.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
#materialPlane_sensor_diy_basic_s3.menu.LoopCore.0=Core 0
#materialPlane_sensor_diy_basic_s3.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

#materialPlane_sensor_diy_basic_s3.menu.EventsCore.1=Core 1
#materialPlane_sensor_diy_basic_s3.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
#materialPlane_sensor_diy_basic_s3.menu.EventsCore.0=Core 0
#materialPlane_sensor_diy_basic_s3.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

#materialPlane_sensor_diy_basic_s3.menu.USBMode.hwcdc=Hardware CDC and JTAG
#materialPlane_sensor_diy_basic_s3.menu.USBMode.hwcdc.build.usb_mode=1
#materialPlane_sensor_diy_basic_s3.menu.USBMode.default=USB-OTG (TinyUSB)
#materialPlane_sensor_diy_basic_s3.menu.USBMode.default.build.usb_mode=0

#materialPlane_sensor_diy_basic_s3.menu.CDCOnBoot.default=Disabled
#materialPlane_sensor_diy_basic_s3.menu.CDCOnBoot.default.build.cdc_on_boot=0
#materialPlane_sensor_diy_basic_s3.menu.CDCOnBoot.cdc=Enabled
#materialPlane_sensor_diy_basic_s3.menu.CDCOnBoot.cdc.build.cdc_on_boot=1

#materialPlane_sensor_diy_basic_s3.menu.MSCOnBoot.default=Disabled
#materialPlane_sensor_diy_basic_s3.menu.MSCOnBoot.default.build.msc_on_boot=0
#materialPlane_sensor_diy_basic_s3.menu.MSCOnBoot.msc=Enabled (Requires USB-OTG Mode)
#materialPlane_sensor_diy_fuWll_s3.menu.MSCOnBoot.msc.build.msc_on_boot=1

